zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_DSPI.h
/*! @name RSER - DMA/Interrupt Request Select and Enable Register */
/*! @{ */

#define DSPI_RSER_DDIF_DIRS_MASK                 (0x4000U)
#define DSPI_RSER_DDIF_DIRS_SHIFT                (14U)
#define DSPI_RSER_DDIF_DIRS_WIDTH                (1U)
#define DSPI_RSER_DDIF_DIRS(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_DDIF_DIRS_SHIFT)) & DSPI_RSER_DDIF_DIRS_MASK)

#define DSPI_RSER_CMDFFF_DIRS_MASK               (0x8000U)
#define DSPI_RSER_CMDFFF_DIRS_SHIFT              (15U)
#define DSPI_RSER_CMDFFF_DIRS_WIDTH              (1U)
#define DSPI_RSER_CMDFFF_DIRS(x)                 (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_CMDFFF_DIRS_SHIFT)) & DSPI_RSER_CMDFFF_DIRS_MASK)

#define DSPI_RSER_RFDF_DIRS_MASK                 (0x10000U)
#define DSPI_RSER_RFDF_DIRS_SHIFT                (16U)
#define DSPI_RSER_RFDF_DIRS_WIDTH                (1U)
#define DSPI_RSER_RFDF_DIRS(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_RFDF_DIRS_SHIFT)) & DSPI_RSER_RFDF_DIRS_MASK)

#define DSPI_RSER_RFDF_RE_MASK                   (0x20000U)
#define DSPI_RSER_RFDF_RE_SHIFT                  (17U)
#define DSPI_RSER_RFDF_RE_WIDTH                  (1U)
#define DSPI_RSER_RFDF_RE(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_RFDF_RE_SHIFT)) & DSPI_RSER_RFDF_RE_MASK)

#define DSPI_RSER_TFIWF_RE_MASK                  (0x40000U)
#define DSPI_RSER_TFIWF_RE_SHIFT                 (18U)
#define DSPI_RSER_TFIWF_RE_WIDTH                 (1U)
#define DSPI_RSER_TFIWF_RE(x)                    (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_TFIWF_RE_SHIFT)) & DSPI_RSER_TFIWF_RE_MASK)

#define DSPI_RSER_RFOF_RE_MASK                   (0x80000U)
#define DSPI_RSER_RFOF_RE_SHIFT                  (19U)
#define DSPI_RSER_RFOF_RE_WIDTH                  (1U)
#define DSPI_RSER_RFOF_RE(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_RFOF_RE_SHIFT)) & DSPI_RSER_RFOF_RE_MASK)

#define DSPI_RSER_DDIF_RE_MASK                   (0x100000U)
#define DSPI_RSER_DDIF_RE_SHIFT                  (20U)
#define DSPI_RSER_DDIF_RE_WIDTH                  (1U)
#define DSPI_RSER_DDIF_RE(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_DDIF_RE_SHIFT)) & DSPI_RSER_DDIF_RE_MASK)

#define DSPI_RSER_SPEF_RE_MASK                   (0x200000U)
#define DSPI_RSER_SPEF_RE_SHIFT                  (21U)
#define DSPI_RSER_SPEF_RE_WIDTH                  (1U)
#define DSPI_RSER_SPEF_RE(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_SPEF_RE_SHIFT)) & DSPI_RSER_SPEF_RE_MASK)

#define DSPI_RSER_DPEF_RE_MASK                   (0x400000U)
#define DSPI_RSER_DPEF_RE_SHIFT                  (22U)
#define DSPI_RSER_DPEF_RE_WIDTH                  (1U)
#define DSPI_RSER_DPEF_RE(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_DPEF_RE_SHIFT)) & DSPI_RSER_DPEF_RE_MASK)

#define DSPI_RSER_CMDTCF_RE_MASK                 (0x800000U)
#define DSPI_RSER_CMDTCF_RE_SHIFT                (23U)
#define DSPI_RSER_CMDTCF_RE_WIDTH                (1U)
#define DSPI_RSER_CMDTCF_RE(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_CMDTCF_RE_SHIFT)) & DSPI_RSER_CMDTCF_RE_MASK)

#define DSPI_RSER_TFFF_DIRS_MASK                 (0x1000000U)
#define DSPI_RSER_TFFF_DIRS_SHIFT                (24U)
#define DSPI_RSER_TFFF_DIRS_WIDTH                (1U)
#define DSPI_RSER_TFFF_DIRS(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_TFFF_DIRS_SHIFT)) & DSPI_RSER_TFFF_DIRS_MASK)

#define DSPI_RSER_TFFF_RE_MASK                   (0x2000000U)
#define DSPI_RSER_TFFF_RE_SHIFT                  (25U)
#define DSPI_RSER_TFFF_RE_WIDTH                  (1U)
#define DSPI_RSER_TFFF_RE(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_TFFF_RE_SHIFT)) & DSPI_RSER_TFFF_RE_MASK)

#define DSPI_RSER_EOQF_RE_MASK                   (0x10000000U)
#define DSPI_RSER_EOQF_RE_SHIFT                  (28U)
#define DSPI_RSER_EOQF_RE_WIDTH                  (1U)
#define DSPI_RSER_EOQF_RE(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_EOQF_RE_SHIFT)) & DSPI_RSER_EOQF_RE_MASK)

#define DSPI_RSER_CMDFFF_RE_MASK                 (0x40000000U)
#define DSPI_RSER_CMDFFF_RE_SHIFT                (30U)
#define DSPI_RSER_CMDFFF_RE_WIDTH                (1U)
#define DSPI_RSER_CMDFFF_RE(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_CMDFFF_RE_SHIFT)) & DSPI_RSER_CMDFFF_RE_MASK)

#define DSPI_RSER_TCF_RE_MASK                    (0x80000000U)
#define DSPI_RSER_TCF_RE_SHIFT                   (31U)
#define DSPI_RSER_TCF_RE_WIDTH                   (1U)
#define DSPI_RSER_TCF_RE(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_RSER_TCF_RE_SHIFT)) & DSPI_RSER_TCF_RE_MASK)
/*! @} */

/*! @name CMD - DSPI_CMD register */
/*! @{ */

#define DSPI_CMD_CMD_MASK                        (0xFFFFU)
#define DSPI_CMD_CMD_SHIFT                       (0U)
#define DSPI_CMD_CMD_WIDTH                       (16U)
#define DSPI_CMD_CMD(x)                          (((uint16_t)(((uint16_t)(x)) << DSPI_CMD_CMD_SHIFT)) & DSPI_CMD_CMD_MASK)
/*! @} */

/*! @name TX - DSPI_TX register */
/*! @{ */

#define DSPI_TX_TX_MASK                          (0xFFFFU)
#define DSPI_TX_TX_SHIFT                         (0U)
#define DSPI_TX_TX_WIDTH                         (16U)
#define DSPI_TX_TX(x)                            (((uint16_t)(((uint16_t)(x)) << DSPI_TX_TX_SHIFT)) & DSPI_TX_TX_MASK)
/*! @} */

/*! @name PUSHR - PUSH TX FIFO Register In Master Mode */
/*! @{ */

#define DSPI_PUSHR_TXDATA_MASK                   (0xFFFFU)
#define DSPI_PUSHR_TXDATA_SHIFT                  (0U)
#define DSPI_PUSHR_TXDATA_WIDTH                  (16U)
#define DSPI_PUSHR_TXDATA(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_PUSHR_TXDATA_SHIFT)) & DSPI_PUSHR_TXDATA_MASK)

#define DSPI_PUSHR_PCS_MASK                      (0x30000U)
#define DSPI_PUSHR_PCS_SHIFT                     (16U)
#define DSPI_PUSHR_PCS_WIDTH                     (2U)
#define DSPI_PUSHR_PCS(x)                        (((uint32_t)(((uint32_t)(x)) << DSPI_PUSHR_PCS_SHIFT)) & DSPI_PUSHR_PCS_MASK)

#define DSPI_PUSHR_PP_MCSC_MASK                  (0x1000000U)
#define DSPI_PUSHR_PP_MCSC_SHIFT                 (24U)
#define DSPI_PUSHR_PP_MCSC_WIDTH                 (1U)
#define DSPI_PUSHR_PP_MCSC(x)                    (((uint32_t)(((uint32_t)(x)) << DSPI_PUSHR_PP_MCSC_SHIFT)) & DSPI_PUSHR_PP_MCSC_MASK)

#define DSPI_PUSHR_PE_MASC_MASK                  (0x2000000U)
#define DSPI_PUSHR_PE_MASC_SHIFT                 (25U)
#define DSPI_PUSHR_PE_MASC_WIDTH                 (1U)
#define DSPI_PUSHR_PE_MASC(x)                    (((uint32_t)(((uint32_t)(x)) << DSPI_PUSHR_PE_MASC_SHIFT)) & DSPI_PUSHR_PE_MASC_MASK)

#define DSPI_PUSHR_CTCNT_MASK                    (0x4000000U)
#define DSPI_PUSHR_CTCNT_SHIFT                   (26U)
#define DSPI_PUSHR_CTCNT_WIDTH                   (1U)
#define DSPI_PUSHR_CTCNT(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_PUSHR_CTCNT_SHIFT)) & DSPI_PUSHR_CTCNT_MASK)

