zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_DSPI.h
#define DSPI_PUSHR_EOQ_MASK                      (0x8000000U)
#define DSPI_PUSHR_EOQ_SHIFT                     (27U)
#define DSPI_PUSHR_EOQ_WIDTH                     (1U)
#define DSPI_PUSHR_EOQ(x)                        (((uint32_t)(((uint32_t)(x)) << DSPI_PUSHR_EOQ_SHIFT)) & DSPI_PUSHR_EOQ_MASK)

#define DSPI_PUSHR_CTAS_MASK                     (0x70000000U)
#define DSPI_PUSHR_CTAS_SHIFT                    (28U)
#define DSPI_PUSHR_CTAS_WIDTH                    (3U)
#define DSPI_PUSHR_CTAS(x)                       (((uint32_t)(((uint32_t)(x)) << DSPI_PUSHR_CTAS_SHIFT)) & DSPI_PUSHR_CTAS_MASK)

#define DSPI_PUSHR_CONT_MASK                     (0x80000000U)
#define DSPI_PUSHR_CONT_SHIFT                    (31U)
#define DSPI_PUSHR_CONT_WIDTH                    (1U)
#define DSPI_PUSHR_CONT(x)                       (((uint32_t)(((uint32_t)(x)) << DSPI_PUSHR_CONT_SHIFT)) & DSPI_PUSHR_CONT_MASK)
/*! @} */

/*! @name POPR - POP RX FIFO Register */
/*! @{ */

#define DSPI_POPR_RXDATA_MASK                    (0xFFFFFFFFU)
#define DSPI_POPR_RXDATA_SHIFT                   (0U)
#define DSPI_POPR_RXDATA_WIDTH                   (32U)
#define DSPI_POPR_RXDATA(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_POPR_RXDATA_SHIFT)) & DSPI_POPR_RXDATA_MASK)
/*! @} */

/*! @name TXFR - Transmit FIFO Registers */
/*! @{ */

#define DSPI_TXFR_TXDATA_MASK                    (0xFFFFU)
#define DSPI_TXFR_TXDATA_SHIFT                   (0U)
#define DSPI_TXFR_TXDATA_WIDTH                   (16U)
#define DSPI_TXFR_TXDATA(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_TXFR_TXDATA_SHIFT)) & DSPI_TXFR_TXDATA_MASK)

#define DSPI_TXFR_TXCMD_TXDATA_MASK              (0xFFFF0000U)
#define DSPI_TXFR_TXCMD_TXDATA_SHIFT             (16U)
#define DSPI_TXFR_TXCMD_TXDATA_WIDTH             (16U)
#define DSPI_TXFR_TXCMD_TXDATA(x)                (((uint32_t)(((uint32_t)(x)) << DSPI_TXFR_TXCMD_TXDATA_SHIFT)) & DSPI_TXFR_TXCMD_TXDATA_MASK)
/*! @} */

/*! @name RXFR - Receive FIFO Registers */
/*! @{ */

#define DSPI_RXFR_RXDATA_MASK                    (0xFFFFFFFFU)
#define DSPI_RXFR_RXDATA_SHIFT                   (0U)
#define DSPI_RXFR_RXDATA_WIDTH                   (32U)
#define DSPI_RXFR_RXDATA(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_RXFR_RXDATA_SHIFT)) & DSPI_RXFR_RXDATA_MASK)
/*! @} */

/*! @name DSICR0 - DSI Configuration Register 0 */
/*! @{ */

#define DSPI_DSICR0_DPCSx_MASK                   (0xFFU)
#define DSPI_DSICR0_DPCSx_SHIFT                  (0U)
#define DSPI_DSICR0_DPCSx_WIDTH                  (8U)
#define DSPI_DSICR0_DPCSx(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_DPCSx_SHIFT)) & DSPI_DSICR0_DPCSx_MASK)

#define DSPI_DSICR0_PP_MASK                      (0x100U)
#define DSPI_DSICR0_PP_SHIFT                     (8U)
#define DSPI_DSICR0_PP_WIDTH                     (1U)
#define DSPI_DSICR0_PP(x)                        (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_PP_SHIFT)) & DSPI_DSICR0_PP_MASK)

#define DSPI_DSICR0_PE_MASK                      (0x200U)
#define DSPI_DSICR0_PE_SHIFT                     (9U)
#define DSPI_DSICR0_PE_WIDTH                     (1U)
#define DSPI_DSICR0_PE(x)                        (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_PE_SHIFT)) & DSPI_DSICR0_PE_MASK)

#define DSPI_DSICR0_PES_MASK                     (0x400U)
#define DSPI_DSICR0_PES_SHIFT                    (10U)
#define DSPI_DSICR0_PES_WIDTH                    (1U)
#define DSPI_DSICR0_PES(x)                       (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_PES_SHIFT)) & DSPI_DSICR0_PES_MASK)

#define DSPI_DSICR0_DMS_MASK                     (0x800U)
#define DSPI_DSICR0_DMS_SHIFT                    (11U)
#define DSPI_DSICR0_DMS_WIDTH                    (1U)
#define DSPI_DSICR0_DMS(x)                       (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_DMS_SHIFT)) & DSPI_DSICR0_DMS_MASK)

#define DSPI_DSICR0_DSICTAS_MASK                 (0x7000U)
#define DSPI_DSICR0_DSICTAS_SHIFT                (12U)
#define DSPI_DSICR0_DSICTAS_WIDTH                (3U)
#define DSPI_DSICR0_DSICTAS(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_DSICTAS_SHIFT)) & DSPI_DSICR0_DSICTAS_MASK)

#define DSPI_DSICR0_DCONT_MASK                   (0x8000U)
#define DSPI_DSICR0_DCONT_SHIFT                  (15U)
#define DSPI_DSICR0_DCONT_WIDTH                  (1U)
#define DSPI_DSICR0_DCONT(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_DCONT_SHIFT)) & DSPI_DSICR0_DCONT_MASK)

#define DSPI_DSICR0_CID_MASK                     (0x10000U)
#define DSPI_DSICR0_CID_SHIFT                    (16U)
#define DSPI_DSICR0_CID_WIDTH                    (1U)
#define DSPI_DSICR0_CID(x)                       (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_CID_SHIFT)) & DSPI_DSICR0_CID_MASK)

#define DSPI_DSICR0_TRRE_MASK                    (0x20000U)
#define DSPI_DSICR0_TRRE_SHIFT                   (17U)
#define DSPI_DSICR0_TRRE_WIDTH                   (1U)
#define DSPI_DSICR0_TRRE(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_TRRE_SHIFT)) & DSPI_DSICR0_TRRE_MASK)

#define DSPI_DSICR0_TPOL_MASK                    (0x40000U)
#define DSPI_DSICR0_TPOL_SHIFT                   (18U)
#define DSPI_DSICR0_TPOL_WIDTH                   (1U)
#define DSPI_DSICR0_TPOL(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_TPOL_SHIFT)) & DSPI_DSICR0_TPOL_MASK)

#define DSPI_DSICR0_TXSS_MASK                    (0x80000U)
#define DSPI_DSICR0_TXSS_SHIFT                   (19U)
#define DSPI_DSICR0_TXSS_WIDTH                   (1U)
#define DSPI_DSICR0_TXSS(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_TXSS_SHIFT)) & DSPI_DSICR0_TXSS_MASK)

#define DSPI_DSICR0_TSBC_MASK                    (0x100000U)
#define DSPI_DSICR0_TSBC_SHIFT                   (20U)
#define DSPI_DSICR0_TSBC_WIDTH                   (1U)
#define DSPI_DSICR0_TSBC(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_TSBC_SHIFT)) & DSPI_DSICR0_TSBC_MASK)

#define DSPI_DSICR0_ITSB_MASK                    (0x200000U)
#define DSPI_DSICR0_ITSB_SHIFT                   (21U)
#define DSPI_DSICR0_ITSB_WIDTH                   (1U)
#define DSPI_DSICR0_ITSB(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_ITSB_SHIFT)) & DSPI_DSICR0_ITSB_MASK)

#define DSPI_DSICR0_TRG_MASK                     (0x400000U)
#define DSPI_DSICR0_TRG_SHIFT                    (22U)
#define DSPI_DSICR0_TRG_WIDTH                    (1U)
#define DSPI_DSICR0_TRG(x)                       (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_TRG_SHIFT)) & DSPI_DSICR0_TRG_MASK)

#define DSPI_DSICR0_FMSZ5_MASK                   (0x800000U)
#define DSPI_DSICR0_FMSZ5_SHIFT                  (23U)
#define DSPI_DSICR0_FMSZ5_WIDTH                  (1U)
#define DSPI_DSICR0_FMSZ5(x)                     (((uint32_t)(((uint32_t)(x)) << DSPI_DSICR0_FMSZ5_SHIFT)) & DSPI_DSICR0_FMSZ5_MASK)

