zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_DSPI.h
#define DSPI_DDR1_DESER_DATA_MASK                (0xFFFFFFFFU)
#define DSPI_DDR1_DESER_DATA_SHIFT               (0U)
#define DSPI_DDR1_DESER_DATA_WIDTH               (32U)
#define DSPI_DDR1_DESER_DATA(x)                  (((uint32_t)(((uint32_t)(x)) << DSPI_DDR1_DESER_DATA_SHIFT)) & DSPI_DDR1_DESER_DATA_MASK)
/*! @} */

/*! @name SSR1 - DSI Serialization Source Select Register 1 */
/*! @{ */

#define DSPI_SSR1_SS_MASK                        (0xFFFFFFFFU)
#define DSPI_SSR1_SS_SHIFT                       (0U)
#define DSPI_SSR1_SS_WIDTH                       (32U)
#define DSPI_SSR1_SS(x)                          (((uint32_t)(((uint32_t)(x)) << DSPI_SSR1_SS_SHIFT)) & DSPI_SSR1_SS_MASK)
/*! @} */

/*! @name DIMR1 - DSI Deserialized Data Interrupt Mask Register 1 */
/*! @{ */

#define DSPI_DIMR1_MASK_MASK                     (0xFFFFFFFFU)
#define DSPI_DIMR1_MASK_SHIFT                    (0U)
#define DSPI_DIMR1_MASK_WIDTH                    (32U)
#define DSPI_DIMR1_MASK(x)                       (((uint32_t)(((uint32_t)(x)) << DSPI_DIMR1_MASK_SHIFT)) & DSPI_DIMR1_MASK_MASK)
/*! @} */

/*! @name DPIR1 - DSI Deserialized Data Polarity Interrupt Register 1 */
/*! @{ */

#define DSPI_DPIR1_DP_MASK                       (0xFFFFFFFFU)
#define DSPI_DPIR1_DP_SHIFT                      (0U)
#define DSPI_DPIR1_DP_WIDTH                      (32U)
#define DSPI_DPIR1_DP(x)                         (((uint32_t)(((uint32_t)(x)) << DSPI_DPIR1_DP_SHIFT)) & DSPI_DPIR1_DP_MASK)
/*! @} */

/*! @name CTARE - Clock and Transfer Attributes Register Extended */
/*! @{ */

#define DSPI_CTARE_DTCP_MASK                     (0x7FFU)
#define DSPI_CTARE_DTCP_SHIFT                    (0U)
#define DSPI_CTARE_DTCP_WIDTH                    (11U)
#define DSPI_CTARE_DTCP(x)                       (((uint32_t)(((uint32_t)(x)) << DSPI_CTARE_DTCP_SHIFT)) & DSPI_CTARE_DTCP_MASK)

#define DSPI_CTARE_FMSZE_MASK                    (0x10000U)
#define DSPI_CTARE_FMSZE_SHIFT                   (16U)
#define DSPI_CTARE_FMSZE_WIDTH                   (1U)
#define DSPI_CTARE_FMSZE(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_CTARE_FMSZE_SHIFT)) & DSPI_CTARE_FMSZE_MASK)
/*! @} */

/*! @name SREX - Status Register Extended */
/*! @{ */

#define DSPI_SREX_CMDNXTPTR_MASK                 (0xFU)
#define DSPI_SREX_CMDNXTPTR_SHIFT                (0U)
#define DSPI_SREX_CMDNXTPTR_WIDTH                (4U)
#define DSPI_SREX_CMDNXTPTR(x)                   (((uint32_t)(((uint32_t)(x)) << DSPI_SREX_CMDNXTPTR_SHIFT)) & DSPI_SREX_CMDNXTPTR_MASK)

#define DSPI_SREX_CMDCTR_MASK                    (0x1F0U)
#define DSPI_SREX_CMDCTR_SHIFT                   (4U)
#define DSPI_SREX_CMDCTR_WIDTH                   (5U)
#define DSPI_SREX_CMDCTR(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_SREX_CMDCTR_SHIFT)) & DSPI_SREX_CMDCTR_MASK)

#define DSPI_SREX_RXCTR4_MASK                    (0x800U)
#define DSPI_SREX_RXCTR4_SHIFT                   (11U)
#define DSPI_SREX_RXCTR4_WIDTH                   (1U)
#define DSPI_SREX_RXCTR4(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_SREX_RXCTR4_SHIFT)) & DSPI_SREX_RXCTR4_MASK)

#define DSPI_SREX_TXCTR4_MASK                    (0x4000U)
#define DSPI_SREX_TXCTR4_SHIFT                   (14U)
#define DSPI_SREX_TXCTR4_WIDTH                   (1U)
#define DSPI_SREX_TXCTR4(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_SREX_TXCTR4_SHIFT)) & DSPI_SREX_TXCTR4_MASK)
/*! @} */

/*! @name TSL - Time Slot Length Register */
/*! @{ */

#define DSPI_TSL_TS0_LEN_MASK                    (0x7FU)
#define DSPI_TSL_TS0_LEN_SHIFT                   (0U)
#define DSPI_TSL_TS0_LEN_WIDTH                   (7U)
#define DSPI_TSL_TS0_LEN(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_TSL_TS0_LEN_SHIFT)) & DSPI_TSL_TS0_LEN_MASK)

#define DSPI_TSL_TS1_LEN_MASK                    (0x7F00U)
#define DSPI_TSL_TS1_LEN_SHIFT                   (8U)
#define DSPI_TSL_TS1_LEN_WIDTH                   (7U)
#define DSPI_TSL_TS1_LEN(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_TSL_TS1_LEN_SHIFT)) & DSPI_TSL_TS1_LEN_MASK)

#define DSPI_TSL_TS2_LEN_MASK                    (0x7F0000U)
#define DSPI_TSL_TS2_LEN_SHIFT                   (16U)
#define DSPI_TSL_TS2_LEN_WIDTH                   (7U)
#define DSPI_TSL_TS2_LEN(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_TSL_TS2_LEN_SHIFT)) & DSPI_TSL_TS2_LEN_MASK)

#define DSPI_TSL_TS3_LEN_MASK                    (0x7F000000U)
#define DSPI_TSL_TS3_LEN_SHIFT                   (24U)
#define DSPI_TSL_TS3_LEN_WIDTH                   (7U)
#define DSPI_TSL_TS3_LEN(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_TSL_TS3_LEN_SHIFT)) & DSPI_TSL_TS3_LEN_MASK)
/*! @} */

/*! @name TS_CONF - Time Slot Configuration Register */
/*! @{ */

#define DSPI_TS_CONF_TS0_MASK                    (0xFU)
#define DSPI_TS_CONF_TS0_SHIFT                   (0U)
#define DSPI_TS_CONF_TS0_WIDTH                   (4U)
#define DSPI_TS_CONF_TS0(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_TS_CONF_TS0_SHIFT)) & DSPI_TS_CONF_TS0_MASK)

#define DSPI_TS_CONF_TS1_MASK                    (0xF0U)
#define DSPI_TS_CONF_TS1_SHIFT                   (4U)
#define DSPI_TS_CONF_TS1_WIDTH                   (4U)
#define DSPI_TS_CONF_TS1(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_TS_CONF_TS1_SHIFT)) & DSPI_TS_CONF_TS1_MASK)

#define DSPI_TS_CONF_TS2_MASK                    (0xF00U)
#define DSPI_TS_CONF_TS2_SHIFT                   (8U)
#define DSPI_TS_CONF_TS2_WIDTH                   (4U)
#define DSPI_TS_CONF_TS2(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_TS_CONF_TS2_SHIFT)) & DSPI_TS_CONF_TS2_MASK)

#define DSPI_TS_CONF_TS3_MASK                    (0xF000U)
#define DSPI_TS_CONF_TS3_SHIFT                   (12U)
#define DSPI_TS_CONF_TS3_WIDTH                   (4U)
#define DSPI_TS_CONF_TS3(x)                      (((uint32_t)(((uint32_t)(x)) << DSPI_TS_CONF_TS3_SHIFT)) & DSPI_TS_CONF_TS3_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group DSPI_Register_Masks */

/*!
 * @}
 */ /* end of group DSPI_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_DSPI_H_) */
